## Plan Result (ptl-jenkins)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.managed_identity_operator[&#34;0&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;1&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;2&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;3&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;4&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;5&#34;]
  * azurerm_role_assignment.managed_identity_operator[&#34;6&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.managed_identity_operator["0"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9e6dd823-0630-41d4-9a58-67cd7d141452"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["1"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["2"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e564e3d3-ade1-457a-86bc-72cd74ec0fc8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["3"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0601ae-de54-4319-9f77-5a35021c74b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["4"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1a4bada3-4107-47e4-a5d7-aa66a580369a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["5"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "63469462-b784-42e8-8a66-20a8840ac84a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.managed_identity_operator["6"] will be created
  + resource "azurerm_role_assignment" "managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourcegroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-cftptl-intsvc-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->